benchmark/results/20260610_190857/serializable_c10_j4.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 4
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 41323
number of failed transactions: 0 (0.000%)
latency average = 2.414 ms
initial connection time = 28.017 ms
tps = 4142.039177 (without initial connection time)