benchmark/results/20260610_190857/serializable_c10_j8.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 8
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 40347
number of failed transactions: 0 (0.000%)
latency average = 2.471 ms
initial connection time = 35.995 ms
tps = 4047.580616 (without initial connection time)