benchmark/results/20260610_190857/serializable_c50_j4.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 4
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 40901
number of failed transactions: 0 (0.000%)
latency average = 12.052 ms
initial connection time = 148.754 ms
tps = 4148.551430 (without initial connection time)